import streamlit as st
import pandas as pd
from datetime import date

df = pd.read_csv("jeju_place.csv")

st.write(df)

# [TODO] lat, lon이라는 컬럼에 위도, 경도 값을 담습니다.

data = {
    "수도이름": ["워싱턴 D.C.", "파리", "베를린", "도쿄", "오타와", "런던", "멕시코시티", "서울", "마드리드", "로마", 
               "캔버라", "브뤼셀", "암스테르담", "오슬로", "스톡홀름", "코펜하겐", "헬싱키", "리스본", "아테네", 
               "프라하", "바르샤바", "부다페스트", "브라티슬라바", "빈", "룩셈부르크", "베른", "더블린", 
               "레이캬비크", "류블랴나"],
    "위도": [38.89511, 48.8566, 52.52, 35.6828, 45.4215, 51.5074, 19.4326, 37.5665, 40.4168, 41.9028,
           -35.2809, 50.8503, 52.3676, 59.9139, 59.3293, 55.6761, 60.1699, 38.7167, 37.9838, 
           50.0755, 52.2297, 47.4979, 48.1486, 48.2082, 49.6117, 46.9481, 53.3498, 64.1355, 43.8476],
    "경도": [-77.03637, 2.3522, 13.405, 139.759, -75.6972, -0.1278, -99.1332, 126.978, -3.7038, 12.4964,
           149.13, 4.3517, 4.9041, 10.7522, 18.0686, 12.5683, 24.9384, -9.139, 23.7275, 
           14.4378, 21.0122, 19.0402, 17.1077, 16.3738, 6.13, 7.4474, -6.2603, -21.8954, 18.3564]
}

# DataFrame으로 변환
df = pd.DataFrame(data)
df[["lat","lon"]] = df[["위도","경도"]]

st.write(df)

# [TODO] 데이터 프레임을 단순히 st.map에 넘겨줍니다.
st.map(df)